[PAD]
[EOS]
[UNK]
[CLS]
[SEP]
[MASK]
the
I
to
a
and
of
was
in
##,
##.
it
that
with
my
is
he
not
as
for
but
be
at
on
you
me
had
or
would
The
his
have
this
by
##s
one
so
if
they
from
Red
##ed
##ing
about
all
##"
no
were
there
like
are
him
out
do
##d
which
Shirt
when
up
them
If
we
could
such
##;
been
did
Porcupine
said
will
who
may
an
He
what
get
any
some
It
she
should
more
their
old
than
##y
going
only
go
her
##ly
two
But
make
house
teacher
Project
##e
school
can
asked
three
thought
might
come
##!
room
made
into
am
see
told
##?
your
other
has
time
even
Clown
principal
fellow
back
after
This
take
students
night
way
don't
came
our
me,
down
Then
me.
Kiyo
work
When
right
looked
how
##t
over
much
know
##s,
just
A
went
then
something
head
far
because
Gutenberg-tm
too
it.
where
own
first
being
before
Hubbard
without
In
As
tell
many
having
good
better
They
So
##ng
"I
##s.
same
face
What
##:
think
said,
it,
There
And
##er
say
off
man
##,"
##'s
those
must
anything
Mr.
through
never
heard
can't
You
very
took
its
away
On
I'm
want
upon
these
seemed
long
found
felt
cannot
##al
wrong
school,
once
matter
kind
began
We
yen
while
sure
saw
quite
left
day
well
still
saying
room,
next
myself
got
boarding
Squash
##."
started
hot
became
She
now
nothing
middle
put
him.
give
called
become
appeared
##n
us
electronic
Tokyo
Shirt.
My
##?"
town
new
half
find
days
bad
To
After
##!"
##o
terms
start
since
show
part
look
letter
here
full
front
While
One
##r
works
this,
place
little
fellows
Badger
watch
use
though
thing
them.
second
salary
returned
red
passed
leave
lady
kept
care
again
Porcupine,
Madonna
"You
"The
##[
##ous
##es
##ed,
written
under
time,
stay
sen
seen
sat
mind
mean
keep
hard
feel
country
answered
[
Shirt,
"What
##]
##on
way,
used
teachers
taking
soon
round
people
making
let
him,
fight
coming
clear
class
brother
No
"That's
"Say,
##'
##se
##re
why
things
them,
talk
taken
straight
stood
rather
met
five
farewell
end
does
both
against
That
"If
##st
##p
##el
you.
wanted
unless
there,
strange
return
public
pay
paper
paid
line
four
fish
dango
brought
bed
Gutenberg
##)
##d,
writing
woman
train
toward
sorry
school.
say,
room.
person
out.
need
name
most
means
isn't
however,
getting
gave
everything
eat
each
dance
business
big
another
able
For
......
"Yes,
"Well,
"No,
"
##le
##ed.
up,
until
that.
that's
teaching
stop
six
side
reason
raise
moment
maid
knew
hotel
help
geisha
following
fellow,
feet
father
eh?
decided
best
always
also
Yedo
Koga
I'll
At
(
"This
"That
##-
##th
##ry
##l
##ion
##g
years
whom
whether
turned
thus
there.
small
set
run
right,
received
others
nor
month
money
meeting
house.
house,
home
fond
followed
expected
every
didn't
comes
call
believe
bath
answer
already
along
account
Not
Kiyo.
Japanese
All
##--
##y,
##ne
##ll
##k
##ive
##i
##h
##en
##e,
you,
whole
twenty
trouble
talking
students,
story
state
simple
said.
really
read
out,
noodle
natural
live
least
last
large
janitor
hour
himself
held
eyes
entered
either
done
different
dark
cut
copyright
certain
attempt
alone
all,
access
[Footnote
Literary
Koga-san
Clown,
Archive
##T
##I
##E
##w
##ty
##n't
##m
##lo
##ke
##ing,
##de
##ce
##an
##a
you're
wouldn't
word
voice
tried
town,
thought,
thinking
ten
surely
suddenly
sign
sight
short
seems
rough
right.
regard
ought
one.
night,
meant
lived
life
less
force
fool
enough
door
dinner
copy
consider
boss
black
bit
between
ask
apologize
all.
affair
Tokyo.
Tokyo,
Squash,
Porcupine.
O
Nobeoka
Foundation
CHAPTER
"A
##wn
##ur
##ts
##te
##or
##led
##it
##able
wonder
within
white
walk
wait
understand
unable
trying
temple
teachers'
sound
somewhat
so,
serious
scene
probably
pretty
position
pity
paragraph
now,
meet
makes
jumped
incident
fell
fault
face.
efforts
donations
boat
behind
beat
bang,
away.
appear
among
almost
agree
accepted
Some
P
OF
E
By
'
"Then
"Is
"I'm
##A
##1
##......
##,--
##ying
##y.
##ting
##ter
##ta
##nce
##lly
##ge
##ful
##et
##ers
##ent
##ble
##ation
##ance
write
water
walking
turn
towel
time.
this.
sweet
stone
stand
springs
spoke
sooner
sick
showed
shall
saying,
rolled
requested
remark
punishment
principal,
poor
personal
past
party
outside
original
opened
open
notice
note
normal
noise
morning
manner
loud
looking
living
lack
inside
idea
hung
here,
hear
forth
fishing
fact
ever
eggs
early
down.
direction
days.
day,
blow
begin
back,
associated
afraid
With
Well,
See
Master
License
How
His
From
English
About
##S
##G
##--I
##x
##ve
##ut
##u
##tion
##ti
##ss
##sa
##ment
##man
##ling
##less
##ing.
##in
##ic
##f
##est
##ee
##ck
##c
##ate
##at
##ant
young
yet
work,
words
wished
wish
turning
top
tax
suit
study
stepped
stared
standing
spirit
single
settled
serve
seem
remain
ran
raised
quit
queer
police
please
place.
place,
piece
pi
physical
particularly
particular
once,
office
neither
narrow
mouth
mother
moon
mathematics
long,
lo
liked
light
laughed.
laugh
intention
indeed
honor
history
helped
head,
hands
hand
grasshoppers
gone
goes
glad
gets
gazed
friend
forty
follow
floor
fee
fe
expect
entirely
easy
dropped
doing
dis
difficult
de
charge
cause
caught
catch
buy
be.
bamboo
back.
ate
act
Yamashiro-ya
United
Section
Professor
Having
Even
Clown.
-
"You're
"No
##0
##tu
##ted
##ri
##rd
##r.
##pe
##ou
##nt
##mp
##mi
##ly.
##ly,
##ku
##ity
##ish
##il
##he
##ence
##co
##be
##b
wrong.
work.
while,
whatever
water,
wanting
voice.
upstairs
up.
twice
trouble,
transfer
town.
touch
tone
together
to.
tired
thoroughly
thirty
then,
tender
table
swimming
style,
stuff
stuck
station
speech
somewhere
shot
shop
sharp
says
salary,
sa
round,
resign
reading
quick
question
provide
proper
previous
present
praise
point
pine
picture
pick
permission
per
pale
over.
order
one,
one's
object
number
now.
none
nobody
nine
nephew
near
named
minutes
men
manner.
ma
long.
leaves
laws
laughed
keeping
job
including
hours
hope
hit
heart
hearing
heard.
haven't
hardly
hand,
ha,
guy
great
given
game
funny
forget
fine
finally
fifty
fetch
fast
entrance
eight
easily
e
duty
drawn
domain
doesn't
distributing
declared
decent
danger
credit
course,
cost
copies
condition
close
clean
class.
case
calling
bought
beach
around
appears
agreement
again,
affect
accept
absurd
Probably
Only
Just
Hotta
European
Be
Bachelor
1.E.
"He
"But
"A-ah
##R
##O
##L
##F
##D
##C
##ving
##ver
##us
##ure
##um
##ue
##the
##t,
##si
##sh
##s!
##rt
##rs
##rk
##ring
##red
##ra
##r,
##que
##ound
##ny
##no
##ness,
##ned
##nd
##lu
##ld
##ies
##ide
##ha
##em
##ea
##ding
##as
##ar
##ak
##age
younger
yen.
wrong,
worry
world
wondered
wide
week
was,
vi
us,
trick
tree
treated
translation
to-night.
to-day
to,
times
this!
third
think,
that,
tempura
teacher,
teach
tea
talked
swollen
surprised
sun
suggested
students.
stopped
stayed
squarely
springs,
speak
sort
sleep
situation
simply
sham
seto-ware
served
servant
seeing
schools
samurai
said;
s
running
rice
restaurant
rest
refund
reasonable
re
raised,
quiet.
potatoes
possible,
possible
po
pleasure
pleased
parted
pain
owner
opening
not.
nose
move
mention
mental
meaning
loss
listen
light,
li
letters
late
knows
know.
jump
it's
invited
incited
impressed
honest
home,
hold
here.
head-teacher
hastily
happened
hall
ha
gro
grabbed
glanced
giving
geishas
future
fuss
further
friends
free
formal
forgot
flat
fifteen
fellows,
feet,
favor
far,
faces
face,
eBook
during
due
drum
dressed
double
desk
departure
days,
day.
dashed
da
crooked
covered
corridor
comply
command
cold
co
class,
changed
celebration
but,
bu
boys
boatman
board
bill
becoming
becomes
be,
banged
attention
asking
and,
alcove
ahead
agreement,
address
added
action
YOU
Why
Who
That's
Shirt-san
Sa
Russian
Once
Nothing
Meanwhile
Isn't
Ikagin
I,
However,
Echigo
Darling
B
4
1
"How
"Ha,
##N
##K
##3
##-b
##--and
##way
##wa
##ves
##und
##un
##tly
##tion,
##su
##so
##ple
##ping
##ory
##ori
##ns
##nk
##ning
##ness.
##ness
##na
##ma
##m,
##lt
##li
##king
##ki
##ked
##ir
##im
##ig
##ied
##ia
##ho
##ght
##eri
##ei
##eat
##do
##dge
##da
##ci
##ch
##ard
##ain
yet.
yen,
yard
worried
won't
woman.
woman,
wife
whose
who,
weak
way.
water.
watch,
warm
walked
volunteers
va
using
unusually
understood
un
twisted
treatment
treat
translator
together,
to-day,
tired,
ticket
thunder
threw
they're
themselves
tenderloin
telling
takes
ta
sympathetic
surprised,
suppose
sudden
successor
student
strong
story.
steps
step
startled
spot
sou
sometimes
society
soaked
so.
slowly
sit
similar
sides
shy
shoji
seriously
separate
sending
seat
say.
satisfied
sake
ro
rikisha
rid
resignation
remarked
real
quiet
pushed
prospect
post
poorly
polite
point,
play
plain
pipe
paying
over,
ordinary
on,
often
official
offer
noticed
not,
nonsense
newspaper
news
net
nature
native
much,
more,
money.
money,
mo
mischief
me;
marching
manage
man.
lu
line.
likely
levy
law
laughing
language
lamp
la
know,
knock
kinds
kids
kick
interest
individual
impatient
ice
houses
honor,
holding
ho
high-collared
her,
happen
handed
greatly
graduated
gra
goes,
go.
gentlemen
gentle
fun
form
fools
fooling
fi
fence
favorite
fact,
fa
extent
except
equal
enjoy
el
effect
edge
ear
dumped
drawing
doubt
dormitory
distribution
distribute
desk,
decline
death
dear
copy,
consolation
considering
considered
commenced
color
coach
character
chance
bring
brain
bra
bow
born
boarded
below
begun
beautiful
beats
attend
ashamed
appeal
anyone
amount
although
al
agreed
again.
administer
addition
add
across
accord
above
ab
Where
Up
U
Two
Turner
THIS
Sir.
Sir,"
Sir,
Since
Say,
S
OR
Minato-ya
Koga,
Ko
Kiyo,
Kazan
Kadoya
Ka
Hotta-san
Gutenberg"
Go
General
Finally
Do
Did
Come
Badger,
Arts
Am
600
1.F.
1.
"tempura"
"Why
"When
"Of
"It
"......
##U
##P
##H
##B
##7
##-t
##-s
##-like
##).
##zing
##ze
##we
##ved
##val
##up
##ught
##uci
##tr
##to
##thi
##ten
##some
##sed
##ro
##rm
##ric
##qui
##ps
##pri
##pi
##ow
##op
##om
##oli
##ok
##nte
##nou
##ni
##nch
##n.
##med
##me
##m.
##la
##kin
##ise
##ion,
##int
##if
##ict
##ical
##gue
##go
##gh
##ger
##ff
##fe
##ert
##er,
##ement
##dling
##cal
##bi
##bb
##ba
##av
##ans
##and
##ad
##ach
##ably
youngsters
you,"
yesterday,
yesterday
year
worse
worrying
works,
working
wor
wooden
withdrew
wise
wind
win
wi
whenever
what's
west
welcome
weak-knee
was.
war
wants
wall
voices
voice,
village
view
usually
uns
uniform
uni
undue
twelve
tune
try
truth,
true
trouble.
trans
train.
tra
tomorrow.
tomorrow,
tomorrow
to-night,
tight
ti
throat
thin,
thi
thank
tempt
temper
teacher.
taste
talks
tact
swords
swa
support
supper.
summer
suffer
sub
su
stu
strength
street
stream
strange.
stick
status
states
staring
star
stamping
spent
sounds
sounded
soon.
something,
slip
sleeves
sleeping
sitting
site
sing
silent
shut
shouting
shouted
shore
shook
shape
sent
sen.
sea
sc
says,
ru
ride
returning
retreat
respect.
resignation,
resign,
requirements
report
replied
remember
relations
regular
regarded
record
receive
raw
questioned
quarrel
putting
purpose
provided
prove
propose
promised
pro
printed
print
pride
presume
prepared
preference
praising
posted
position,
poem
pockets
pocket
playing
placed
phrase
peeping
pass
paper,
panel
pack
others,
oranges
opposite
opinions
only,
online
once.
on.
older
officers
off.
off,
occupy
occasion
obtain
obligation
o'clock
o
noodles
night.
necessarily
nearly
nature,
myself.
myself,
movement
more.
monkeys
money"
mind.
mess
meditating
me,"
matter,
mass
married
lying
low
love
lot
lose
located
lined
light.
life.
lie
length
left.
lecturing
leaving
laughs
later,
land
known
knowing
kid,
join
itself
it?
intended
insult
instead
insist
inside,
inn
impressed,
hundred
hu
however
holder
hobby
high
hero
her.
heart,
happened,
habit
ground
greater
grateful
grand
goruki
good.
girl
gate
ga
g
fully
fu
freely
format
foreign
forced
flew
fishing.
first,
fired
fire
finished
finding
fat
famous
false
fall
explanation
explaining
explained
exp
evening
etc.
enough.
enough,
en
else
either.
eating
east
eBooks
draw
down,
do.
do,
directly
direction.
dinner,
dignity
difference
died
di
devil
determined
desks
desire
defend
death,
damage
cur
cro
crazy
cr
course
country.
corner
contact
confess
compliance
compared
comp
common
colors
collection
coa
closed
clock
claim
cheek
cheap
chastisement
challenged
cha
center
case,
carry
carried
cared
calm
ca
bunch
built
bugle
brother,
broom
bri
breath
breast
break
bound
borrow
block
beside
beneficial
beneath
bend
belong
beg
before.
bed,
bag
bad,
backwoods
away,
autumn
assume
art
arrived
arrival
arranged
aroused
around,
argument
are,
appointment
anyway,
anyway
anything,
anybody
anxiety
another,
air
agreement.
ago,
affairs,
affair,
addressed
acquainted
acknowledgment
absence
You're
Yoshikawa
Why,
Whatever
Tr
Toyamas
Thus
They're
Take
THE
T
Strange
States
St
Sino-Japanese
Si
RE
R
PROJECT
Nozeri
Nobody
NOT
Mo
Miss
Masuya
Madonna,
Madam
Ma
L
Kin-nosuke
Kantaro
Information
Indeed,
I've
I'd
However
Hotta.
Her
GUTENBERG
Fu
Foundation,
English,
De
Da
Confucius
Besides,
BOTCHAN
According
ANY
6
5
3
***
(a
(MASTER
"To
"Let's
"Let
"I'll
"Hey,
"Don't
"Cut
##M
##8
##6
##5
##2
##......"
##.....
##-sh
##-c
##-a
##--it
##--b
##--a
##--"
##),
##zed
##z
##you
##yo
##yl
##ye
##wi
##way,
##ward
##vo
##vid
##vice
##vi
##vely
##ve.
##uts
##used
##use
##uri
##ura
##ulat
##ul
##uct
##uch
##ty.
##ture
##tt
##ton
##tle
##tis
##tic
##tes
##te,
##tch
##tan
##sy
##stl
##st,
##sses
##sing
##shed
##sha
##sh.
##sc
##s;
##s,"
##rve
##ru
##rs,
##rough
##rot
##ress
##ren
##rea
##rb
##rate
##rat
##r-
##pre
##pped
##pp
##pes
##ped
##oto
##oti
##ot
##osit
##ose
##ora
##ope
##oned
##ond
##oke
##nn
##nit
##nic
##nding
##nan
##n"
##ms
##mor
##mn
##ming
##ls
##lli
##lit
##lie
##let
##le,
##lar
##key
##ka
##jo
##ised
##ip
##ion.
##inat
##ime
##ill
##id
##ib
##hi
##hea
##h,
##gs
##gar
##g.
##fted
##fied
##fi
##face
##es.
##er.
##ep
##ened
##ely
##ek
##ef
##ect
##ec
##e.
##dy
##duc
##ds
##dit
##dering
##cy
##ct
##con
##cks
##cked
##cial
##chin
##chi
##ched
##ce.
##ca
##bra
##br
##bli
##bility
##ber
##aw
##ato
##ation,
##ating
##ary,
##ant,
##ank
##am
##als
##ally
##ag
##act
##ab
you?
you'd
you!
yellow
years.
years,
year,
y
wrote
written:
wri
wrestle
wound
worthy
worked
wore
words.
wondering
wonderful
won
women
winked
window,
window
wife,
why,
whoop
whoever
whistle
whisper
whi
well-known
well,
weather
wear
ways
watch.
washing
washed
warned
wallopped
wa
w
vulgar
volunteer
visitor
visiting
visit
viol
usual
user
us.
unfa
unexpected
une
understood,
unconcerned
unc
una
types
twist
tur
tunny
trifling
trees
tree.
travel
transferred
trademark.
trademark,
trademark
trad
tough,
tough
tooth
tongue
tone,
together.
tiny
thunderous
thumb
three,
thought.
this?
things.
things,
thing,
there!
then.
tells
teachers,
tasted
tank,
tank
tall
sympathy
sy
sword
swept
suspect
surprise
sure."
sure.
sure,
success
subject
style
studiously
struck
stronger.
stronger
strolling
strike
stri
streets
stratum
strangely
str
stones
sti
steamer
stated
startling
stands
stage
sta
squash
square,
square
springs.
spread
spo
splendid
spite
speech,
spectator
specified
spec
spe
space
spa
sp
son
solicit
sole
snap
smooth
smiled
smelled
smash
slow
slept
slapped
sky-high
sky,
sky
skill
sk
size
sixty
sixteen
situated
simple-hearted
silk
sil
sideways
side,
shows
showing
shoulder
short,
shooting
shirt
shaking
shadows
shadow
several
seven
settle
ser
sentence
sense.
sense
senior
sell
self-
seemed,
secret
seat,
season
seals
sea.
scheme
scar
saucy
satisfied,
sand
rushed
rows
rowing
row
roundabout
rooms.
rooms,
rooms
roll
rods
roar
road
river,
river
ris
reve
result
rest.
responsibility
respect
resolved
resembled
required
require
request
replacement
repent
rep
rent
rendered
remarks
remark,
remained
rem
relative
regulations
refused
reflect
refined
reckless
recently
receipt
rec
reasoning
reason,
rear
ready,
ready
readily
reaching
rattled
rank
purpose.
pure
pur
punishment,
punish
published
pu
prowling
province
providing
proved
protect
proposition
profession
prof
proceed
probable
private
priest
pretext
presented
prefer
predecessor
pre
power
pound
pot
position.
popular
pleasure,
plant
plan
places
pillow
physically
ph
persuaded
persons
personality
person.
permitted
perhaps
performing,
perfectly
people.
pen
patient
patch
passes
pardon
paragraphs
par
pains
pages
page
pa
p
outrageous
out-talk
others.
other,
original.
ordered
opportunity
office.
offered
o'clock.
novel
normals
noisy
no.
night-
nice
newly
negotiations
neck
nearby
narrow,
names
muscle
mu
moved
mother.
mother,
mother's
mostly
mosquitoes
more?
moral
month,
moment.
mistake
mission
miss
milk
might,
midnight
middles
method
mercy
mentioned
meeting,
measured
means,
meal
me!
matters,
mathematics,
material
master
marked
mark
manner,
man,
man's
magazine
lower
lost
loose
looks
look-out
logic
lively
literature
listened
links
line,
limited
limitation
limit.
limit
lies.
letter-paper,
letter,
leisurely
legs
learn
leading
le
laughed,
last.
last,
kitchen,
kindness
kid.
kid
k
ju
job,
ji
it."
it,"
it!
island
inv
interesting
inter
intently
intend
instructor
insolent
insistent
insisted
innocent
inherited
information
infer
inf
independent
indeed.
indeed!"
included
inclined
inc
ina
in.
impr
important
imp
imagined
hyp
hush
hur
human
housekeeping
hours,
hook
honest.
home.
ho,
himself.
himself,
highly
hide
hereditary
heavy
hear,
health.
health
heads
head.
harm
harder
hard,
happens,
handle
hand.
half,
ha!"
guys
guy,
guests
guess
gru
ground,
gre
grave
granted
grammar
graduate
good-natured
gold
going.
glo
glaring
girls
gentle,
general
gaze
gas
garden
gang
gallantry
future.
friendly
fresh
frequently
fre
frankly
fr
fore
foot
fool.
fo
flying
flower
flippant
flannel
fl
fix.
fishe
fish.
firmly
finish
finger
fine.
fine,
figure
fight,
fields
fetched
fellow.
feet.
fathom
father,
fashion.
family
facts,
extra
extend
explanation,
expenses,
expe
excused
example
exactly
ex
evil
evidence
eventually
evening.
evening,
escape
equally
entrance,
enthusiastic
enter
ent
enjoyed
em
else,
editor
editions
edibles
eaten
easy.
dwelt
dull
dress.
dress
drank
dr
done.
doing,
dog
distributed
distance
displaying
display
dish
disgusted
disgrace
discuss
disclaimer
discharge
disc
dirty
direct
die
diction
devilish
dev
deserved
des
derive
depend
demand
deliver
delayed
degrees
definitely
defi
defence
defective
deeply
deep
declined
declare
deciding
dec
date
dastardly
darn
dango.
dangling
dandy
damn
curios
culture
crook
cried
creature
creating
cra
cowardly
court
course.
couple
country,
corner,
cor
convenience
constant
considerate
consequence,
confirm
confidence
concern
conc
con
computer
complying
complicated
compl
committed
come.
come,
coins
clothes
clo
clerk
clash
circumstances
cho
chin
chief
chi
cheerful
chat
characteristic
character,
change
chances
chalk
chain
cesspool
centre
cedar
ceased
ce
cast
case.
carp
careful
car
cap
c
by.
by,
bully
broken
bringing
branch
boyhood
boy
box
bowls
boneheads
bold
boarder
bo
blunder.
blunder
blu
blood
blocks
blind
bled
blankly
blades
bitter
birds
bigger
bi
bet
besides
believed
beginning
begged
before,
bee
bea
bath,
based
banzai
bang
ban
ball
bad.
ba
awoke
awkward
aw
attractive
attended
attempted
attack
atmosphere
arms
arm
approved
applicable
appearance.
appealed
apparently
apologized
ap
anywhere
anyway.
anybody,
anxious
antique
answered,
angry
amusing
amber
altogether
alive
airs
air.
ai
ago
age
afterwards
afterward
advance
admiration
absolutely
Yamashiro-ya.
Wright,
Without
Will
What's
Web
Wasn't
Those
These
Thereupon
Then,
Sumida
Su
States.
Somebody
Se
School
Re
Post
Particularly
Other
Of
Now,
No,
New
Natsume
Most
Mi
Many
Look
Let's
LIMITED
Kyushu
Kamakura
Kaioku
Judging
J
Its
Is
Instead
Imperial
Hotta,
Ha
Gre
Good
G
Foundation's
Fe
FOR
F
Except
Everybody
During
Don't
Darling,
D
Conf
Coming
Ca
C
Botchan
Better
Besides
Badger.
Ba
Asai
Ar
Any
Another
And,
Among
Although
AGREE
90
50
5-yen
30
2
15
1.F.3,
1.E.8
1.E.7
1.E.1
.......
(or
(Master
'Tis
"that
"teacher"
"tea
"t
"sasa-ame"
"s
"on
"g
"dango
"b
"a
"Yes,"
"Wo
"Will
"Where
"Too
"They
"There
"Then,
"Thank
"Stop
"So
"S
"Quit
"Project
"O,
"Master
"M
"K
"Isn't
"In
"Ha
"G
"Damn
"By
"Botchan"
"Bet
"And
"All
##],
##Y
##TH
##SE
##Q
##ND
##LA
##IN
##EN
##CE
##;--
##...
##-w
##-up
##-r
##-na
##-ma
##-k
##-g
##-e
##-and-
##--you
##--w
##--the
##--that's
##--so
##,--b
##(
##zz
##zed,
##zai
##za
##ys
##yright
##yond
##ym
##yed,
##yc
##yal
##ya
##xt
##wrappe
##work
##wled
##wise,
##wise
##win
##wil
##wh
##weet
##ween
##wea
##wardly
##versity
##ven
##vel
##va
##v'n
##uti
##ute
##ut.
##ust
##using
##usi
##ushima
##us,
##urish
##urb
##upi
##unni
##uni
##ume
##ult
##ulous
##ull
##ulge
##ulated
##ui
##ugh
##ug
##ue,
##udal
##ud
##uc
##uary
##ua
##ty,
##ttle
##tting
##tties
##tter
##tte
##tsy
##tsu
##trad
##tou
##tor
##tions
##tin
##till
##tical
##thful
##ther
##th.
##th,
##terat
##ter.
##tened
##temper
##tem
##tary
##tain
##tai
##t-
##sued
##sti
##ster
##sten
##sted
##ste
##stant
##sta
##st.
##ssion
##ssed
##squ
##spir
##spe
##sm
##sk
##sion
##sider
##shin-
##shi
##shed.
##sel
##sciously
##satisfied
##sal
##sa-ame
##s'
##s"
##ruki
##rtunate
##rti
##rther
##rte
##rt,
##rse
##rsa
##rre
##rop
##roo
##rob
##rmed
##rle
##rity
##risi
##ris
##ries
##rie
##ria
##rete
##ressi
##res
##ree
##rec
##re.
##re!"
##rdin
##ray
##ranks
##ran
##rage
##rable
##quent
##qua
##pu
##ption
##pposi
##ppo
##ppi
##pos
##pol
##po
##pl
##pir
##phitheat
##ph
##pet
##pan
##pa
##over
##ov
##ous.
##ough
##oth
##oss
##ors
##orm,
##ord
##orc
##orate
##or:
##oquence
##opp
##opa
##ook
##oo
##ont
##ons
##on,
##omet
##olunt
##oll
##ole
##oky
##oin
##oh
##ograph
##ode
##ocat
##oc
##o,
##ntl
##ntern
##nta
##nt,
##nse
##nosu
##nor
##noo
##nkled
##nif
##ngling
##ngle
##nge
##ng.
##nf
##ney
##nest
##ners
##nec
##ndi
##nder
##nded,
##nc
##nation
##nat
##nape
##n-
##n,
##mur
##mpi
##mon
##mo
##mmo
##mmered
##mma
##mit
##mini
##min
##miliar
##mh
##mer
##ment,
##mell
##mel
##mbl
##mb
##mal
##machi
##m-
##ly-
##lus
##low
##looded
##ll,
##lk
##ling,
##line
##lin
##like
##light
##lia
##lfi
##les
##len
##lease
##ldn't
##lding
##lati
##lat
##lad
##lace
##l.
##l,
##know
##ker
##k,
##jit
##jimachi-ku
##je
##jac
##j
##ize
##ity.
##ity,
##itu
##ito
##itle
##itions
##ition
##iting
##ities
##ited
##itat
##iso
##ism
##isi
##ished
##isha
##is
##ired
##ious
##ior
##io
##ins
##ini
##ings
##ingly
##ines
##ined
##ine
##ind
##inc
##inating
##ility
##iling
##iled
##igue
##ight
##igen
##ificence
##ific
##ience
##iday
##ice
##ication
##iate
##hy
##hum
##how
##hol
##hm
##hin
##hiev
##hief
##hes
##heri
##has
##hand
##h.
##gust
##gula
##gra
##gor
##gn
##gin
##gic
##gged
##gg
##ged
##ga
##fy
##ful.
##ful,
##form
##fore,
##foo
##fo
##fl
##fined
##ffle
##ffer
##ffe
##fect
##fe.
##fa
##ex
##ew
##eve
##ety
##ett
##etic
##etch
##et,
##est.
##essor
##essary
##ess
##esp
##esh
##ering
##eren
##ered
##eon
##eo
##enti
##eno
##ender
##ency
##ena
##en't
##ema
##elling
##ega
##ecause
##ease
##e-h
##e-
##e,--
##ducat
##du
##dr
##dn
##dly
##dles
##dia
##der,
##dents
##deed
##ded
##ddle
##dding
##dd
##dated
##d;
##d.
##cus
##cul
##cto
##cs
##cr
##clean
##cl
##cking
##cke
##cious
##cing
##cide
##chief
##chi,
##chas
##cha
##ch.
##cest
##cel
##ced
##ccu
##cat
##c)
##by
##butions
##bs
##bout
##bon
##bo
##bly
##bling
##bbled
##bar
##back
##ay
##ations
##ated,
##ated
##ary
##arti
##arly
##ari
##ardi
##arde
##aped
##apan
##ap
##ani
##ane
##amin
##ali
##aking
##ait
##air
##aim
##ail
##agin
##af
##ado
##ading
##acity
##achi,
##ace
##ac
##a,
yourself
yours
young,
you've
you!"
yet?
yesterday.
year.
yard,
yanked
wrong,"
wretche
wrestling
wrath
wrapper
wra
worse.
world.
works.
wood
women,
with.
wit
wishing
wip
willow
wil
wides
wide.
why.
whispering
whispered
which,
wherever
whereupon
when,
whatsoever.
wetted
wet
were,
went.
went,
well-to-do
well-re
well-
weight
weighed
web
we've
we're
watching
wash
warr
want,"
wan
wall,
waiting
waited
wagon
void
virtues,
vir
vigorous
vigor,
vigor
views
view.
victory
victim
very,
version
venture
vegetable
ve
variety
valises
val
vacant.
vaca
uttering
utter
ushered
ur
ups
upper
unyielding
unw
unusual
untir
untimely
unta
unreliable
unpleasant
unn
unli
unfo
uneasi
understanding.
understanding,
understand,
unconscious,
uncon
unco
uncertain
unbecoming
umbrella
type.
type
typ
two,
tw
tune,
trust
trunk
trip
tricks
trem
trees.
tree,
tray
translation.
transcri
traits
training,
traced
trace
tr
toy
tower
total
tor
topic
tone.
tofu
toe
to-night
to-day.
title
tiresome
tipp
times,
till
tied
tid
thus,
thu
thrust
thrown
throw
thrice,
threa
thinks
they'll
thereafter
there?
there's
then,"
themselves,
them;
that;
territory
terms,
tenacity.
ten.
tempura,
temper.
temp
temerity
technical
tears
tearful
teachers.
tea."
tea.
te
tap
tanzaku
tankei,"
tankei
tank."
talking,
tail
t
system,
synonym
sword-dance
swing
swindler
swi
swell-headed
sweetmeat
swallow
swagger
surv
surr
surprise.
surp
surg
suppresse
supposed,
suppose,
supper,
supper
superiority
superior
super-swanker
sup
sunk
summ
sul
suggestion
suggest
sugar
suffered
suddenly.
succeeded
suc
subsist
subs
submissive
subject.
sturdy
stunt
stumbling
stuffed
studying
study,
studied
strung
strong,
stroll
stripe
strict
strength,
street,
streak
straw
straightforward
straight.
story,
stories
store
stops
stop.
stomach
sto
stiff
sticks
ster
steamship
steal
steadily
station.
station,
statement
starting
started,
stark
stamp
stab
squatted
square.
squa
sprouts
spra
sporty
sport
spoke,
splash
spirit.
spic
spending
spend
speed.
speech-making,
special
speaking,
sounded,
sore,
sonovagun
songs
song
something.
somehow.
somebody
some.
some,"
solicitation
soli
sold
soft
socia
so?
sno
sneaki
sne
snapped
smoothly
smoking
smokes
smoke
smile.
smile
smart
small,
slipped
slight
sliced
sli
sleeve
sleepy
sleep.
slap
slan
slab
sla
sl
skin
skilled
sizzl
singing
sing,
since.
simpleton
similarly
similarity
sim
silence.
significantly
sight.
sigh
siege"
sick.
si
shunned
shr
shown
shoved
shoulders
shot,
shorte
short.
shore.
shops
shone
shoji.
shoes
shock
sho
shirts
shirt.
shirt,
shin
shi
shel
sheets
shari
share,
share
shallow
shak
sha
severe
sevent
settling
settled,
setting
serious,
sentiment
sentence,
sensation
send
select
seldom
seek
see.
sections
secretly
seconded
second-hand
sec
search
sea-bream
sea,
se
scri
scratch
scraped
scrap
scoundrel
score.
sco
school-
scheme,
schedule
scamp
save
sauce
satisfy
satisfactory
sati
sass
sasa-ame
sarcas
sand.
samisen
same.
sale
salary.
rule
ruin
royalties
rowed
rout
rouse
rose
rooming
roof
rode
rock
ripen
ripe,
rikishaman
riding
rides
rib
ri
rhythmic
rh
reveal
return,
retraction
retract
retainer
ret
resulted
restrictions
responsive.
responsib
respons
responded
respectfully!
respectfully
resort
resigning
resignation.
residence
reserve
research
res
requesting
repulsive
repro
represent
reported
reply
replied,
repeating
repeatedly
repeated
rented
removed
remonstrate
remarks,
remarked,
remark;
remaining
reli
rel
rejoi
regret
registered
regardless
refuse
refus
refund.
refr
reflecti
references
ref
redistribut
redd
red.
recr
recovered
reconciled
recit
recess
rece
recall
reasons
realized
realiz
realised
readable
read,
reaction
reache
re-use
rays
rave
rattle
rate,
rate
rash
rare
rail
rai
rag
racke
ra
quietly
quiet,
quick-temper
questions
questioning
question,
quality,
qualities
qua
qu
pushing
push
purposes
purposely
purchase
pup
punishing
pum
pulling
pulled
provok
provision
province.
province,
proud
protests
protested
propriet
proposing
proposed
proportion
property
prone
promotion
promoting
prominent
prom
profi
product
produced
processi
problem
principle
price-list
price
prevented
prev
preten
prese
prepare
prejudice
preferable
preceding
precedent
prec
practically
practi
potatoes,
possessed
pose
poring
porch
pond
politely,
polishing
pole
poke
pointed
poetry
pocket.
pocket,
plot
plenty
pleas
plays
platform
planning
planned
plainly
place!
pla
pitied
pipe,
pillow;
pillar
picturesque
physics,
petty
pet
person,
persisten
period
performed
performances
perf
pencils
peeped
peculiar
pebble-stone
peace
pea
pe
payments
pay,
patronize
patron
pathetic
pat
past,
passing
pass,
partly
parting
parti
part.
part,
parade
paper.
paper-string
pan
pal
pair
painte
paint
painfully
packing
package
owns
owners
owlish
overnight
outside.
outright
outlandishly
outlandish
out;
out!
ourselves
otherwise
other.
original,
org
order,
orange
oppo
opinion.
opinion,
opinion
open.
one-
older,
oil
offer.
offense
offend
off-
of,
occur
occupied
occasions
obtaining
obstinate.
obs
oblig
objects
objecti
numer
nuisance
noti
nothing.
nothing,
nose.
north
noodles,
noodle-house
nonsensical
nonsense.
none.
non
noisy,
nobler
nicknamed
nick
nervous
nerves,
nephew's
neighbors
needle
necess
nearest
neare
ne
nations
nap
name.
naked
na
myself,--
mur
mun
mumbling
much."
much.
moving
move,
mouth,
mountain
mortifying
morrow
morning.
mor
moonlight
mood
monoton
mon
mollycoddle
modifi
modesty
moderate
mixed
mix
mistaken.
mistaken
mist
misse
miserabl
mischiefs.
misc
mis
mirror,
minute.
minute,
mine,
mine
minds
million
mile
mighty
mid-
merry
merits
merely
mere
mer
mem
melted
meeting.
medium,
medium
med
means.
meals
mea
me?"
me."
me,--this
me,--
matt
mats
match
mart
marry
marrow
married.
married,
marr
mark,
map
manners
maintain
main
magnificent
made,
mad.
lumpy
loved
loude
losing
lordly
look-out,
longed
log
locust
locked
location
local
loaded
loa
lives
little,
literature,
literator,"
literary
litera
listening
likes
liked,
like.
like,
life,
lieu
lies
lie.
license,
license
liable
liability
level
letters.
let's
less.
leniency
legal
leg
left,
led
lecture,
lecture
learning
lean
lead
lea
lav
laughter.
laugh.
latt
later.
later
lasting
languages
laid
lady,
kowtow
kom
knowledges
knowledge
knotty
knocker
knocked
knife
knees.
knees
kindness,
kind.
kind,
kill
kiddies
kicks
kamaboko
jumping
jumped,
judgment
judging
judged
judge
jos
jolly
jokes
joke
jo
jerked
jerk
jeer
jacka
jabbe
j
it?"
irritating
irritated
irrigat
irresponsib
invite
invitation
inva
introduct
introduce
intolera
interpret
interesting.
inten
intell
instructors,
instructors
instructi
instinct
insti
instance,
inst
insistent.
insignificant
ink-cake
inju
inh
informed
influence.
influence,
inexcusable
indulge
induced
indign
indicat
indi
ind
increasing
increased
increase
inconstant,
incon
incom
include
incit
incidentally
in,
impressive
impossible
impos
impartial
immediately
imari
imaginati
im
illness
ill-
il
ignoran
identif
ideal
id
husband
hurry
hunt
hungry
hunger
humiliati
howl
house-
hours.
hour,
hotel;
hotel.
hot-springs
hot-
hot,
hostile
host
hope!
hoo
holler
hole
hol
hired
hip
hind
hill
high-
hid
hic
hesitating
hereafter
here,"
helpless,
helped,
help,
heels
hectograph
heavie
heaven
heat
hearty
hearts.
heartily
hears
heard,
health,
haz
hated
hate
hat
hang
hands.
hands,
handkerchief.
hallooed
half.
half-
hai
guilty
guide
guest
guess.
guarantee
grown
group.
group
grin
gri
green
greasy
gray
grated
grat
grasshoppers,
grasshopper.
grasshopper
gras
granite
gradua
grab
government
gossip
goruki,
good-
good"
goo-goo
gongs
going,"
goes!
god
glu
glories
glittering
gle
glass
gla
gives
give-and-take
giggle
gi
gents
gentlemen,"
gentleman,
generous
generally
gener
geisha.
geisha,
ge
gazing
gay
gathering,
gather
gate.
garden.
garden,
games
game.
game,
future,
further,
furnish
furious
fullest
front,
from,
fro
frivolous
fried
fresh,
freedom
fox
fourth
four-flusher
forward,
forward
formerly
former
formed
formats
form.
forgiv
foremost
forehead.
for.
footsteps
fools!
folk
folding
fold
fluffy
flowers
floor.
floor-mats
floor,
floated
float
flo
flippant.
flash
flapping
flame
fla
fix
fit
fishing,
fish,
first.
firm
fired,
finishing
fill
files
filed
file
fighting,
fighting
fiery
festival
fertilis
fellows.
fellow!
fees
feed
federal
fear
favorably
faults
fast,
fashioned
fashion,
fashion
farther
farm
fancy.
fancy
famous.
family.
family,
fame
fairly
fair.
faint
failed
fai
fading
faded
facts
fact.
facing
faced
face?
eyes.
eye
expressions
expressed
explained,
explain
experience
expenses
expend
exi
exhi
exercise
exempt
exe
excuses
excuse
excited.
excited,
exchange
excel
exc
exasperat
evident
everywhere.
everywhere
everybody
est
err
eras
eradicate
er
equipment
entity
enthusiasm
entertainment
ensur
enquired
engagement
engaged
enem
endur
endorse
encouraging
enc
employees
employ
emp
embarrassed.
ema
elsewhere
else.
eloquent
elev
electronically
elect
elated
effort.
effort,
effort
effective
educator,
educational
education.
education
ed
economi
echoed
eating,
easily.
easier
ears
each,
ea
eBooks,
dy
dw
dust.
dull-head
drowsy
drop
dro
drive
drinking
drink.
drink
dri
dreamed
dream,
dream
drawl
drawings
dragg
dozen
doubly
door.
door-
done,
donate
dodging
diver
div
distr
distincti
distance,
dist
disposition,"
dispos
displayed
disl
dishes
disgustingly
discover
discouraged
disco
discl
discharged
disapp
directions
directed
dip
dinner.
dim
dil
dignity.
dignified
difficulty
died,
diamond
dexter
deuce
detest
determin
detain
details
detailed
detach
dest
despise
desperat
designs
deserves
describing
described
derivative
depending
dep
denounced
denie
demanding
demanded
delicate
deli
degrading
degraded
defies
defect
deep-
declare.
declaration
decision
decide
dece
dealer
deal.
dead.
dead,
dazzle
daz
daughter
dashing
dash
darted
dark,
dango,
dancers
damper
dad
d
customs
cust
curtain
curse
curious
cup
crystal
cry,
crushed
crowd
crossed
crop
criticisms
critic
cried.
cried,
created
cowed
cowards
cowardice
coward
cover
courtesy
courtesied
counter
countenance,
counted
count
couldn't
cou
cot
costs
cost.
correction
correct
corr
copying,
copying
coppe
cop
cooled
cool
cooked
convinced
convert
conversation
convenient
conv
contri
contrary
continued,
continue
content
conte
contain
constantly
consolation,
considerable
considera
consequence
conse
cons
connoisseur
congr
confine
conf
concluding
concept
compromise
composi
compose
compliments
complied
complet
complaints
complain
comparatively
company
compa
commit
commendable
commen
commande
command.
coming,
comfort
combin
combat
college
coll
cold.
coin
cod
coaxing
coat
clung
closer
clogs
clerk,
classmates
classes
clapped
cla
circumstances,
circumstance
circ
cigarette
ci
chopp
choice
chip
chill
children
childhood
chicken
chew
chestnut
chest.
chess
check
cheating
cheated,
chas
charit
chaps
chairs
chagrin,
certainly
ceremony
cent,
cent
cautious
caused
catchy
carpet
cares
careless
care.
care!"
card
capable
cane,
candi
camp
calls
calculate
ca-an't
by-the-bye.
butt
busy,
burst
burn
bur
bunch.
bump
bull-dog
building.
building
brusque
brushe
brush,
bruise
brother.
broom,
brig
brief
breeze
breathe
breakfast,
breakfast
brea
brazen
brandishing
branded
brace
br
bowl
bowing
bottom,
bottom
bottles
bother
borrowed
bore!
bor
booze
books,
boo
bonze
bones
bone
bomb
body,
body
boat.
boat,
board,
blushed
blurted
bluff
blows
blown
blowing
blockhead
bleed
blanket,
blanket
blank
blame
bl
bite
bike
bid
better.
better,
bent
benefit
below.
belly
belle,
bell
believable
belie
behavior.
behavior
behav
behalf
been,
beds
beautiful.
beau
beating
beaten
beaming
bathed
bath?
bath.
bath-
bastard
bas
barri
barracks
barb
banging
bang.
band
bamboo-
balloon
badger.
badger
awkward.
awe-struck
awa
available
av
authorit
audibly
audacity
attract
attack,
attached
assur
assumed
assistance
assi
aspect
asleep
asked;
asked,
artist
art.
arrangements
arrang
aro
arm,
are.
ar
approached
approach
appro
appreciati
appreciated
appointed
appl
appetite
appearing
appearance
appar
apologies
apolog
apart
anytime
anything.
answering
answer,
annual
annoying
annoyed
announc
angle,
anger,
ancestors
ami
am.
am,
alternately
alternat
also?
already?
already.
already,
aloud,
allowed
allow
all-day
alike
ali
aged
again?"
ag
afterward,
afternoon,
afternoon
after,
affording
afford
affinity
affected
affairs
affair.
advised
advisab
advice.
advantage
adv
adopt
admi
addresses,
addresses
additional
ad
actually
actual
actor
active
act.
acqu
acknowledged
accu
account,
according
acco
accidental
accepting
ac
absorbing
absorbed
abs
ability.
ability,
ability
abed
aback
[E
Your
You'll
Yogen
Yo
Yes,
Yasotaro
Y
Wr
Wou
Wonder
Wo
Whenever
We'll
Wa
WI
WARRANTY
WARRANTIES
Vi
Very
Vanilla
Use
Upon
Unless
Uni
Un
U.S.
Toyama
Tos
Tokyo?
Tokyo-kid
To-day
Tipp
Thro
Tho
Think
Th
Terms
Temp
Tada
Ta
TRA
THAT
Surely
Suppose
Such
Su-chan,
Stu
Station
States,
Starner
Squash.
Spe
Sometimes
So,
Shri
Shou
Shortly
Shirt?
Shioku
Shimbashi
Shikoku
Shi
September,
School.
Said
START
Royalty
Right
Rev
Rep
Redistributi
Really
R.
Pu
Proofreading
Produced
Po
PG
Out
Or
Online
Om
Now
Nor
Nobeoka,
Ni
Next
Newspaper
Nevertheless
Neither
Ne
NO
N
Must
Moreover
Miyazaki
Mitsunaka
Missi
Mine
Mik
Middle
Men
Me
Maru
Man
Madonna.
Madonna-san
Lord
Looking
Live
Like
Li
Late
La
LIAB
Koga.
Koga-san,
Ki
Ke
Kawa
Kanda-ku,
Kan
Kagurazaka
Kadoya.
K.
K
Japan
J.
Island
International
Ikagins
Ikagin,
Idaten
IND
INC
I.
Hot
Ho
Hiuga
Hea
Hart
Hakone
Haginos.
Ha,
H
Gutenberg's
Gro
Grasshoppers
Gorky
Get
Furu
Fr
Fortunately
First
Father
Fa
FULL
Exactly
Every
Ei
EX
EBOOK
Dr.
Donations
Distributed
Di
Devil
David
Date:
Darn
Darling),
DISTRIBUT
DI
DARLING)
DAMAGES
Cou
Cop
Cont
Con
Co
Chuck
Chink
China
Chi
Ch
CON
Buddhist
Bo
Blank
Because
Bastard
Ban
BREACH
B.A.
B.
Au
Aoshima
An
Also
Aizu
Aioi
Ah-Sing
Ah
Ag
Add
ASCII"
A-ah
99
9
8868.
8
7
59
4.
25
200
20
17-syllable
14
11
1.F.3.
1.C
......"
(ri
(i
(an
'tis
'gan
'A
"we
"w
"utai"
"uranari"
"u
"to
"this
"the
"re
"p
"no
"it
"ho
"hatam
"haiku"
"h
"grasshop
"gr
"good
"ge
"fr
"fi
"d
"c
"bo
"an
"Your
"Yes.
"Yes
"With
"What's
"We
"Was
"Want
"W
"Umh"
"U
"Two
"Teacher!"
"Teacher
"Ta
"Sure
"Since
"Shut
"See
"Red
"Really
"Rather
"R
"Push
"Prof
"Porcupine
"Please,
"Please
"Plain
"P
"Our
"Ou
"On
"Nothing
"Not
"Mo
"Might
"Mean
"Long
"Lo
"Just
"I've
"How?
"Hooray!
"Hi
"Here
"Hello
"He's
"H'm
"Grasshoppers
"Going
"Go
"Fo
"Ex
"Eve
"Eh?
"Do
"Dar
"D
"Come
"Co
"Ca
"Besides,
"Arrived
"Am
"Ah,
"After
"About
##[D]).
##[1
##Wh
##VE
##V
##UND
##SS
##RECT,
##RA
##PL
##OR
##NTA
##NT
##NS
##NIT
##NE
##Ma
##MER
##MENT
##LI
##LE
##Japan
##J
##IVE
##IDE
##ICE
##Hu
##ES
##EM
##ED
##DI
##CT
##Bl
##BILITY
##Ar
##ATION
##AR
##AL,
##9
##7,
##6.
##5.
##41
##4.
##4
##2]
##2.
##12
##.,
##-way
##-war
##-wa
##-to
##-stor
##-st
##-skinned
##-sized
##-roo
##-po
##-pa
##-p
##-of-
##-of
##-o
##-no-
##-n
##-making
##-mai
##-li
##-la
##-in-
##-hearted
##-h
##-f
##-dr
##-do
##-collared
##-brush
##-ah
##-I
##--wh
##--s
##--quite
##,000
##*
##'ve
##'t
##'m
##'ll
##'d
##',
##"--a
##v
##Z
##W
##/
##%
##~
##}
##|
##{
##q
##`
##^
##\
##X
##@
##>
##=
##<
##+
##&
##$
###
##_
?
r
z
0
u
^
!
m
V
,
}
\
_
;
%
:
W
Q
<
)
`
@
.
>
f
&
v
M
q
l
+
h
|
#
Z
b
X
x
]
{
n
i
~
$
/
*
=
